cases/droplets2Didf/system/VOFSetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      VOFSetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultSpecies
(
);

liquidPhaseName  alpha1;
vaporPhaseName   none;

droplets
(
    Drop1
    {
        center   (0 0.003 0.00411);
        radius   (0 0.001 0.001);
        delVapor 1e-4;
        U        (0 0 -1);
        liquidSpecies
        (
        );
        vaporSpecies
        (
        );
    }
    
    Drop2
    {
        center   (0 0.003 0.00189);
        radius   (0 0.001 0.001);
        delVapor 1e-4;
        U        (0 0 1);
        liquidSpecies
        (
        );
        vaporSpecies
        (
        );
    }

);


// ************************************************************************* //
